dblockil42/UsingF28379D_ForMechatronics/C2000Ware_4_01_00_00/device_support/f2837xd/common/deprecated/inc/hw_gpio.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GPBCSEL4 register
//
//*****************************************************************************
#define GPIO_GPBCSEL4_GPIO56_S    0
#define GPIO_GPBCSEL4_GPIO56_M    0xF         // GPIO56 Master CPU Select
#define GPIO_GPBCSEL4_GPIO57_S    4
#define GPIO_GPBCSEL4_GPIO57_M    0xF0        // GPIO57 Master CPU Select
#define GPIO_GPBCSEL4_GPIO58_S    8
#define GPIO_GPBCSEL4_GPIO58_M    0xF00       // GPIO58 Master CPU Select
#define GPIO_GPBCSEL4_GPIO59_S    12
#define GPIO_GPBCSEL4_GPIO59_M    0xF000      // GPIO59 Master CPU Select
#define GPIO_GPBCSEL4_GPIO60_S    16
#define GPIO_GPBCSEL4_GPIO60_M    0xF0000     // GPIO60 Master CPU Select
#define GPIO_GPBCSEL4_GPIO61_S    20
#define GPIO_GPBCSEL4_GPIO61_M    0xF00000    // GPIO61 Master CPU Select
#define GPIO_GPBCSEL4_GPIO62_S    24
#define GPIO_GPBCSEL4_GPIO62_M    0xF000000   // GPIO62 Master CPU Select
#define GPIO_GPBCSEL4_GPIO63_S    28
#define GPIO_GPBCSEL4_GPIO63_M    0xF0000000  // GPIO63 Master CPU Select

//*****************************************************************************
//
// The following are defines for the bit fields in the GPBLOCK register
//
//*****************************************************************************
#define GPIO_GPBLOCK_GPIO32       0x1         // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO33       0x2         // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO34       0x4         // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO35       0x8         // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO36       0x10        // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO37       0x20        // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO38       0x40        // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO39       0x80        // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO40       0x100       // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO41       0x200       // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO42       0x400       // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO43       0x800       // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO44       0x1000      // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO45       0x2000      // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO46       0x4000      // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO47       0x8000      // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO48       0x10000     // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO49       0x20000     // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO50       0x40000     // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO51       0x80000     // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO52       0x100000    // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO53       0x200000    // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO54       0x400000    // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO55       0x800000    // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO56       0x1000000   // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO57       0x2000000   // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO58       0x4000000   // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO59       0x8000000   // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO60       0x10000000  // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO61       0x20000000  // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO62       0x40000000  // Configuration Lock bit for this
                                              // pin
#define GPIO_GPBLOCK_GPIO63       0x80000000  // Configuration Lock bit for this
                                              // pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPBCR register
//
//*****************************************************************************
#define GPIO_GPBCR_GPIO32         0x1         // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO33         0x2         // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO34         0x4         // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO35         0x8         // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO36         0x10        // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO37         0x20        // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO38         0x40        // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO39         0x80        // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO40         0x100       // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO41         0x200       // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO42         0x400       // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO43         0x800       // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO44         0x1000      // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO45         0x2000      // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO46         0x4000      // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO47         0x8000      // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO48         0x10000     // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO49         0x20000     // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO50         0x40000     // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO51         0x80000     // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO52         0x100000    // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO53         0x200000    // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO54         0x400000    // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO55         0x800000    // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO56         0x1000000   // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO57         0x2000000   // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO58         0x4000000   // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO59         0x8000000   // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO60         0x10000000  // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO61         0x20000000  // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO62         0x40000000  // Configuration lock commit bit
                                              // for this pin
#define GPIO_GPBCR_GPIO63         0x80000000  // Configuration lock commit bit
                                              // for this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCCTRL register
//
//*****************************************************************************
#define GPIO_GPCCTRL_QUALPRD0_S   0
#define GPIO_GPCCTRL_QUALPRD0_M   0xFF        // Qualification sampling period
                                              // for GPIO64 to GPIO71
#define GPIO_GPCCTRL_QUALPRD1_S   8
#define GPIO_GPCCTRL_QUALPRD1_M   0xFF00      // Qualification sampling period
                                              // for GPIO72 to GPIO79
#define GPIO_GPCCTRL_QUALPRD2_S   16
#define GPIO_GPCCTRL_QUALPRD2_M   0xFF0000    // Qualification sampling period
                                              // for GPIO80 to GPIO87
#define GPIO_GPCCTRL_QUALPRD3_S   24
#define GPIO_GPCCTRL_QUALPRD3_M   0xFF000000  // Qualification sampling period
                                              // for GPIO88 to GPIO95

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCQSEL1 register
//
//*****************************************************************************
#define GPIO_GPCQSEL1_GPIO64_S    0
#define GPIO_GPCQSEL1_GPIO64_M    0x3         // Select input qualification type
                                              // for GPIO64
#define GPIO_GPCQSEL1_GPIO65_S    2
#define GPIO_GPCQSEL1_GPIO65_M    0xC         // Select input qualification type
                                              // for GPIO65
#define GPIO_GPCQSEL1_GPIO66_S    4
#define GPIO_GPCQSEL1_GPIO66_M    0x30        // Select input qualification type
                                              // for GPIO66
#define GPIO_GPCQSEL1_GPIO67_S    6
#define GPIO_GPCQSEL1_GPIO67_M    0xC0        // Select input qualification type
                                              // for GPIO67
#define GPIO_GPCQSEL1_GPIO68_S    8
#define GPIO_GPCQSEL1_GPIO68_M    0x300       // Select input qualification type
                                              // for GPIO68
#define GPIO_GPCQSEL1_GPIO69_S    10
#define GPIO_GPCQSEL1_GPIO69_M    0xC00       // Select input qualification type
                                              // for GPIO69
#define GPIO_GPCQSEL1_GPIO70_S    12
#define GPIO_GPCQSEL1_GPIO70_M    0x3000      // Select input qualification type
                                              // for GPIO70
#define GPIO_GPCQSEL1_GPIO71_S    14
#define GPIO_GPCQSEL1_GPIO71_M    0xC000      // Select input qualification type
                                              // for GPIO71
#define GPIO_GPCQSEL1_GPIO72_S    16
#define GPIO_GPCQSEL1_GPIO72_M    0x30000     // Select input qualification type
                                              // for GPIO72
#define GPIO_GPCQSEL1_GPIO73_S    18
#define GPIO_GPCQSEL1_GPIO73_M    0xC0000     // Select input qualification type
                                              // for GPIO73
#define GPIO_GPCQSEL1_GPIO74_S    20
#define GPIO_GPCQSEL1_GPIO74_M    0x300000    // Select input qualification type
                                              // for GPIO74
#define GPIO_GPCQSEL1_GPIO75_S    22
#define GPIO_GPCQSEL1_GPIO75_M    0xC00000    // Select input qualification type
                                              // for GPIO75
#define GPIO_GPCQSEL1_GPIO76_S    24
#define GPIO_GPCQSEL1_GPIO76_M    0x3000000   // Select input qualification type
                                              // for GPIO76
#define GPIO_GPCQSEL1_GPIO77_S    26
#define GPIO_GPCQSEL1_GPIO77_M    0xC000000   // Select input qualification type
                                              // for GPIO77
#define GPIO_GPCQSEL1_GPIO78_S    28
#define GPIO_GPCQSEL1_GPIO78_M    0x30000000  // Select input qualification type
                                              // for GPIO78
#define GPIO_GPCQSEL1_GPIO79_S    30
#define GPIO_GPCQSEL1_GPIO79_M    0xC0000000  // Select input qualification type
                                              // for GPIO79

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCQSEL2 register
//
//*****************************************************************************
#define GPIO_GPCQSEL2_GPIO80_S    0
#define GPIO_GPCQSEL2_GPIO80_M    0x3         // Select input qualification type
                                              // for GPIO80
#define GPIO_GPCQSEL2_GPIO81_S    2
#define GPIO_GPCQSEL2_GPIO81_M    0xC         // Select input qualification type
                                              // for GPIO81
#define GPIO_GPCQSEL2_GPIO82_S    4
#define GPIO_GPCQSEL2_GPIO82_M    0x30        // Select input qualification type
                                              // for GPIO82
#define GPIO_GPCQSEL2_GPIO83_S    6
#define GPIO_GPCQSEL2_GPIO83_M    0xC0        // Select input qualification type
                                              // for GPIO83
#define GPIO_GPCQSEL2_GPIO84_S    8
#define GPIO_GPCQSEL2_GPIO84_M    0x300       // Select input qualification type
                                              // for GPIO84
#define GPIO_GPCQSEL2_GPIO85_S    10
#define GPIO_GPCQSEL2_GPIO85_M    0xC00       // Select input qualification type
                                              // for GPIO85
#define GPIO_GPCQSEL2_GPIO86_S    12
#define GPIO_GPCQSEL2_GPIO86_M    0x3000      // Select input qualification type
                                              // for GPIO86
#define GPIO_GPCQSEL2_GPIO87_S    14
#define GPIO_GPCQSEL2_GPIO87_M    0xC000      // Select input qualification type
                                              // for GPIO87
#define GPIO_GPCQSEL2_GPIO88_S    16
#define GPIO_GPCQSEL2_GPIO88_M    0x30000     // Select input qualification type
                                              // for GPIO88
#define GPIO_GPCQSEL2_GPIO89_S    18
#define GPIO_GPCQSEL2_GPIO89_M    0xC0000     // Select input qualification type
                                              // for GPIO89
#define GPIO_GPCQSEL2_GPIO90_S    20
#define GPIO_GPCQSEL2_GPIO90_M    0x300000    // Select input qualification type
                                              // for GPIO90
#define GPIO_GPCQSEL2_GPIO91_S    22
#define GPIO_GPCQSEL2_GPIO91_M    0xC00000    // Select input qualification type
                                              // for GPIO91
#define GPIO_GPCQSEL2_GPIO92_S    24
#define GPIO_GPCQSEL2_GPIO92_M    0x3000000   // Select input qualification type
                                              // for GPIO92
#define GPIO_GPCQSEL2_GPIO93_S    26
#define GPIO_GPCQSEL2_GPIO93_M    0xC000000   // Select input qualification type
                                              // for GPIO93
#define GPIO_GPCQSEL2_GPIO94_S    28
#define GPIO_GPCQSEL2_GPIO94_M    0x30000000  // Select input qualification type
                                              // for GPIO94
#define GPIO_GPCQSEL2_GPIO95_S    30
#define GPIO_GPCQSEL2_GPIO95_M    0xC0000000  // Select input qualification type
                                              // for GPIO95

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCMUX1 register
//
//*****************************************************************************
#define GPIO_GPCMUX1_GPIO64_S     0
#define GPIO_GPCMUX1_GPIO64_M     0x3         // Defines pin-muxing selection
                                              // for GPIO64
#define GPIO_GPCMUX1_GPIO65_S     2
#define GPIO_GPCMUX1_GPIO65_M     0xC         // Defines pin-muxing selection
                                              // for GPIO65
#define GPIO_GPCMUX1_GPIO66_S     4
#define GPIO_GPCMUX1_GPIO66_M     0x30        // Defines pin-muxing selection
                                              // for GPIO66
#define GPIO_GPCMUX1_GPIO67_S     6
#define GPIO_GPCMUX1_GPIO67_M     0xC0        // Defines pin-muxing selection
                                              // for GPIO67
#define GPIO_GPCMUX1_GPIO68_S     8
#define GPIO_GPCMUX1_GPIO68_M     0x300       // Defines pin-muxing selection
                                              // for GPIO68
#define GPIO_GPCMUX1_GPIO69_S     10
#define GPIO_GPCMUX1_GPIO69_M     0xC00       // Defines pin-muxing selection
                                              // for GPIO69
#define GPIO_GPCMUX1_GPIO70_S     12
#define GPIO_GPCMUX1_GPIO70_M     0x3000      // Defines pin-muxing selection
                                              // for GPIO70
#define GPIO_GPCMUX1_GPIO71_S     14
#define GPIO_GPCMUX1_GPIO71_M     0xC000      // Defines pin-muxing selection
                                              // for GPIO71
#define GPIO_GPCMUX1_GPIO72_S     16
#define GPIO_GPCMUX1_GPIO72_M     0x30000     // Defines pin-muxing selection
                                              // for GPIO72
#define GPIO_GPCMUX1_GPIO73_S     18
#define GPIO_GPCMUX1_GPIO73_M     0xC0000     // Defines pin-muxing selection
                                              // for GPIO73
#define GPIO_GPCMUX1_GPIO74_S     20
#define GPIO_GPCMUX1_GPIO74_M     0x300000    // Defines pin-muxing selection
                                              // for GPIO74
#define GPIO_GPCMUX1_GPIO75_S     22
#define GPIO_GPCMUX1_GPIO75_M     0xC00000    // Defines pin-muxing selection
                                              // for GPIO75
#define GPIO_GPCMUX1_GPIO76_S     24
#define GPIO_GPCMUX1_GPIO76_M     0x3000000   // Defines pin-muxing selection
                                              // for GPIO76
#define GPIO_GPCMUX1_GPIO77_S     26
#define GPIO_GPCMUX1_GPIO77_M     0xC000000   // Defines pin-muxing selection
                                              // for GPIO77
#define GPIO_GPCMUX1_GPIO78_S     28
#define GPIO_GPCMUX1_GPIO78_M     0x30000000  // Defines pin-muxing selection
                                              // for GPIO78
#define GPIO_GPCMUX1_GPIO79_S     30
#define GPIO_GPCMUX1_GPIO79_M     0xC0000000  // Defines pin-muxing selection
                                              // for GPIO79

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCMUX2 register
//
//*****************************************************************************
#define GPIO_GPCMUX2_GPIO80_S     0
#define GPIO_GPCMUX2_GPIO80_M     0x3         // Defines pin-muxing selection
                                              // for GPIO80
#define GPIO_GPCMUX2_GPIO81_S     2
#define GPIO_GPCMUX2_GPIO81_M     0xC         // Defines pin-muxing selection
                                              // for GPIO81
#define GPIO_GPCMUX2_GPIO82_S     4
#define GPIO_GPCMUX2_GPIO82_M     0x30        // Defines pin-muxing selection
                                              // for GPIO82
#define GPIO_GPCMUX2_GPIO83_S     6
#define GPIO_GPCMUX2_GPIO83_M     0xC0        // Defines pin-muxing selection
                                              // for GPIO83
#define GPIO_GPCMUX2_GPIO84_S     8
#define GPIO_GPCMUX2_GPIO84_M     0x300       // Defines pin-muxing selection
                                              // for GPIO84
#define GPIO_GPCMUX2_GPIO85_S     10
#define GPIO_GPCMUX2_GPIO85_M     0xC00       // Defines pin-muxing selection
                                              // for GPIO85
#define GPIO_GPCMUX2_GPIO86_S     12
#define GPIO_GPCMUX2_GPIO86_M     0x3000      // Defines pin-muxing selection
                                              // for GPIO86
#define GPIO_GPCMUX2_GPIO87_S     14
#define GPIO_GPCMUX2_GPIO87_M     0xC000      // Defines pin-muxing selection
                                              // for GPIO87
#define GPIO_GPCMUX2_GPIO88_S     16
#define GPIO_GPCMUX2_GPIO88_M     0x30000     // Defines pin-muxing selection
                                              // for GPIO88
#define GPIO_GPCMUX2_GPIO89_S     18
#define GPIO_GPCMUX2_GPIO89_M     0xC0000     // Defines pin-muxing selection
                                              // for GPIO89
#define GPIO_GPCMUX2_GPIO90_S     20
#define GPIO_GPCMUX2_GPIO90_M     0x300000    // Defines pin-muxing selection
                                              // for GPIO90
#define GPIO_GPCMUX2_GPIO91_S     22
#define GPIO_GPCMUX2_GPIO91_M     0xC00000    // Defines pin-muxing selection
                                              // for GPIO91
#define GPIO_GPCMUX2_GPIO92_S     24
#define GPIO_GPCMUX2_GPIO92_M     0x3000000   // Defines pin-muxing selection
                                              // for GPIO92
#define GPIO_GPCMUX2_GPIO93_S     26
#define GPIO_GPCMUX2_GPIO93_M     0xC000000   // Defines pin-muxing selection
                                              // for GPIO93
#define GPIO_GPCMUX2_GPIO94_S     28
#define GPIO_GPCMUX2_GPIO94_M     0x30000000  // Defines pin-muxing selection
                                              // for GPIO94
#define GPIO_GPCMUX2_GPIO95_S     30
#define GPIO_GPCMUX2_GPIO95_M     0xC0000000  // Defines pin-muxing selection
                                              // for GPIO95

