dblockil42/UsingF28379D_ForMechatronics/C2000Ware_4_01_00_00/device_support/f2837xd/common/deprecated/inc/hw_gpio.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GPCDIR register
//
//*****************************************************************************
#define GPIO_GPCDIR_GPIO64        0x1         // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPCDIR_GPIO65        0x2         // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPCDIR_GPIO66        0x4         // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPCDIR_GPIO67        0x8         // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPCDIR_GPIO68        0x10        // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPCDIR_GPIO69        0x20        // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPCDIR_GPIO70        0x40        // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPCDIR_GPIO71        0x80        // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPCDIR_GPIO72        0x100       // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPCDIR_GPIO73        0x200       // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPCDIR_GPIO74        0x400       // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPCDIR_GPIO75        0x800       // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPCDIR_GPIO76        0x1000      // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPCDIR_GPIO77        0x2000      // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPCDIR_GPIO78        0x4000      // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPCDIR_GPIO79        0x8000      // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPCDIR_GPIO80        0x10000     // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPCDIR_GPIO81        0x20000     // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPCDIR_GPIO82        0x40000     // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPCDIR_GPIO83        0x80000     // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPCDIR_GPIO84        0x100000    // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPCDIR_GPIO85        0x200000    // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPCDIR_GPIO86        0x400000    // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPCDIR_GPIO87        0x800000    // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPCDIR_GPIO88        0x1000000   // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPCDIR_GPIO89        0x2000000   // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPCDIR_GPIO90        0x4000000   // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPCDIR_GPIO91        0x8000000   // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPCDIR_GPIO92        0x10000000  // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPCDIR_GPIO93        0x20000000  // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPCDIR_GPIO94        0x40000000  // Defines direction for this pin
                                              // in GPIO mode
#define GPIO_GPCDIR_GPIO95        0x80000000  // Defines direction for this pin
                                              // in GPIO mode

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCPUD register
//
//*****************************************************************************
#define GPIO_GPCPUD_GPIO64        0x1         // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPCPUD_GPIO65        0x2         // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPCPUD_GPIO66        0x4         // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPCPUD_GPIO67        0x8         // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPCPUD_GPIO68        0x10        // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPCPUD_GPIO69        0x20        // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPCPUD_GPIO70        0x40        // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPCPUD_GPIO71        0x80        // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPCPUD_GPIO72        0x100       // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPCPUD_GPIO73        0x200       // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPCPUD_GPIO74        0x400       // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPCPUD_GPIO75        0x800       // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPCPUD_GPIO76        0x1000      // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPCPUD_GPIO77        0x2000      // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPCPUD_GPIO78        0x4000      // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPCPUD_GPIO79        0x8000      // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPCPUD_GPIO80        0x10000     // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPCPUD_GPIO81        0x20000     // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPCPUD_GPIO82        0x40000     // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPCPUD_GPIO83        0x80000     // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPCPUD_GPIO84        0x100000    // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPCPUD_GPIO85        0x200000    // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPCPUD_GPIO86        0x400000    // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPCPUD_GPIO87        0x800000    // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPCPUD_GPIO88        0x1000000   // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPCPUD_GPIO89        0x2000000   // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPCPUD_GPIO90        0x4000000   // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPCPUD_GPIO91        0x8000000   // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPCPUD_GPIO92        0x10000000  // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPCPUD_GPIO93        0x20000000  // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPCPUD_GPIO94        0x40000000  // Pull-Up Disable control for
                                              // this pin
#define GPIO_GPCPUD_GPIO95        0x80000000  // Pull-Up Disable control for
                                              // this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCINV register
//
//*****************************************************************************
#define GPIO_GPCINV_GPIO64        0x1         // Input inversion control for
                                              // this pin
#define GPIO_GPCINV_GPIO65        0x2         // Input inversion control for
                                              // this pin
#define GPIO_GPCINV_GPIO66        0x4         // Input inversion control for
                                              // this pin
#define GPIO_GPCINV_GPIO67        0x8         // Input inversion control for
                                              // this pin
#define GPIO_GPCINV_GPIO68        0x10        // Input inversion control for
                                              // this pin
#define GPIO_GPCINV_GPIO69        0x20        // Input inversion control for
                                              // this pin
#define GPIO_GPCINV_GPIO70        0x40        // Input inversion control for
                                              // this pin
#define GPIO_GPCINV_GPIO71        0x80        // Input inversion control for
                                              // this pin
#define GPIO_GPCINV_GPIO72        0x100       // Input inversion control for
                                              // this pin
#define GPIO_GPCINV_GPIO73        0x200       // Input inversion control for
                                              // this pin
#define GPIO_GPCINV_GPIO74        0x400       // Input inversion control for
                                              // this pin
#define GPIO_GPCINV_GPIO75        0x800       // Input inversion control for
                                              // this pin
#define GPIO_GPCINV_GPIO76        0x1000      // Input inversion control for
                                              // this pin
#define GPIO_GPCINV_GPIO77        0x2000      // Input inversion control for
                                              // this pin
#define GPIO_GPCINV_GPIO78        0x4000      // Input inversion control for
                                              // this pin
#define GPIO_GPCINV_GPIO79        0x8000      // Input inversion control for
                                              // this pin
#define GPIO_GPCINV_GPIO80        0x10000     // Input inversion control for
                                              // this pin
#define GPIO_GPCINV_GPIO81        0x20000     // Input inversion control for
                                              // this pin
#define GPIO_GPCINV_GPIO82        0x40000     // Input inversion control for
                                              // this pin
#define GPIO_GPCINV_GPIO83        0x80000     // Input inversion control for
                                              // this pin
#define GPIO_GPCINV_GPIO84        0x100000    // Input inversion control for
                                              // this pin
#define GPIO_GPCINV_GPIO85        0x200000    // Input inversion control for
                                              // this pin
#define GPIO_GPCINV_GPIO86        0x400000    // Input inversion control for
                                              // this pin
#define GPIO_GPCINV_GPIO87        0x800000    // Input inversion control for
                                              // this pin
#define GPIO_GPCINV_GPIO88        0x1000000   // Input inversion control for
                                              // this pin
#define GPIO_GPCINV_GPIO89        0x2000000   // Input inversion control for
                                              // this pin
#define GPIO_GPCINV_GPIO90        0x4000000   // Input inversion control for
                                              // this pin
#define GPIO_GPCINV_GPIO91        0x8000000   // Input inversion control for
                                              // this pin
#define GPIO_GPCINV_GPIO92        0x10000000  // Input inversion control for
                                              // this pin
#define GPIO_GPCINV_GPIO93        0x20000000  // Input inversion control for
                                              // this pin
#define GPIO_GPCINV_GPIO94        0x40000000  // Input inversion control for
                                              // this pin
#define GPIO_GPCINV_GPIO95        0x80000000  // Input inversion control for
                                              // this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCODR register
//
//*****************************************************************************
#define GPIO_GPCODR_GPIO64        0x1         // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO65        0x2         // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO66        0x4         // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO67        0x8         // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO68        0x10        // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO69        0x20        // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO70        0x40        // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO71        0x80        // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO72        0x100       // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO73        0x200       // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO74        0x400       // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO75        0x800       // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO76        0x1000      // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO77        0x2000      // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO78        0x4000      // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO79        0x8000      // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO80        0x10000     // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO81        0x20000     // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO82        0x40000     // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO83        0x80000     // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO84        0x100000    // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO85        0x200000    // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO86        0x400000    // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO87        0x800000    // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO88        0x1000000   // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO89        0x2000000   // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO90        0x4000000   // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO91        0x8000000   // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO92        0x10000000  // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO93        0x20000000  // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO94        0x40000000  // Outpout Open-Drain control for
                                              // this pin
#define GPIO_GPCODR_GPIO95        0x80000000  // Outpout Open-Drain control for
                                              // this pin

//*****************************************************************************
//
// The following are defines for the bit fields in the GPCGMUX1 register
//
//*****************************************************************************
#define GPIO_GPCGMUX1_GPIO64_S    0
#define GPIO_GPCGMUX1_GPIO64_M    0x3         // Defines pin-muxing selection
                                              // for GPIO64
#define GPIO_GPCGMUX1_GPIO65_S    2
#define GPIO_GPCGMUX1_GPIO65_M    0xC         // Defines pin-muxing selection
                                              // for GPIO65
#define GPIO_GPCGMUX1_GPIO66_S    4
#define GPIO_GPCGMUX1_GPIO66_M    0x30        // Defines pin-muxing selection
                                              // for GPIO66
#define GPIO_GPCGMUX1_GPIO67_S    6
#define GPIO_GPCGMUX1_GPIO67_M    0xC0        // Defines pin-muxing selection
                                              // for GPIO67
#define GPIO_GPCGMUX1_GPIO68_S    8
#define GPIO_GPCGMUX1_GPIO68_M    0x300       // Defines pin-muxing selection
                                              // for GPIO68
#define GPIO_GPCGMUX1_GPIO69_S    10
#define GPIO_GPCGMUX1_GPIO69_M    0xC00       // Defines pin-muxing selection
                                              // for GPIO69
#define GPIO_GPCGMUX1_GPIO70_S    12
#define GPIO_GPCGMUX1_GPIO70_M    0x3000      // Defines pin-muxing selection
                                              // for GPIO70
#define GPIO_GPCGMUX1_GPIO71_S    14
#define GPIO_GPCGMUX1_GPIO71_M    0xC000      // Defines pin-muxing selection
                                              // for GPIO71
#define GPIO_GPCGMUX1_GPIO72_S    16
#define GPIO_GPCGMUX1_GPIO72_M    0x30000     // Defines pin-muxing selection
                                              // for GPIO72
#define GPIO_GPCGMUX1_GPIO73_S    18
#define GPIO_GPCGMUX1_GPIO73_M    0xC0000     // Defines pin-muxing selection
                                              // for GPIO73
#define GPIO_GPCGMUX1_GPIO74_S    20
#define GPIO_GPCGMUX1_GPIO74_M    0x300000    // Defines pin-muxing selection
                                              // for GPIO74
#define GPIO_GPCGMUX1_GPIO75_S    22
#define GPIO_GPCGMUX1_GPIO75_M    0xC00000    // Defines pin-muxing selection
                                              // for GPIO75
#define GPIO_GPCGMUX1_GPIO76_S    24
#define GPIO_GPCGMUX1_GPIO76_M    0x3000000   // Defines pin-muxing selection
                                              // for GPIO76
#define GPIO_GPCGMUX1_GPIO77_S    26
#define GPIO_GPCGMUX1_GPIO77_M    0xC000000   // Defines pin-muxing selection
                                              // for GPIO77
#define GPIO_GPCGMUX1_GPIO78_S    28
#define GPIO_GPCGMUX1_GPIO78_M    0x30000000  // Defines pin-muxing selection
                                              // for GPIO78
#define GPIO_GPCGMUX1_GPIO79_S    30
#define GPIO_GPCGMUX1_GPIO79_M    0xC0000000  // Defines pin-muxing selection
                                              // for GPIO79

